[System]
; 全局开关，设置为 0 将禁用补丁所有功能
Enable=1

[Font]
; 字体文件名，必须放置在游戏根目录或重定向文件夹内
; 留空则使用系统默认字体
FileName=galgame_cnjp.ttf

; 字体名称（CreateFont 中的 FaceName）
; 建议与 FileName 中的字体内部名称保持一致
FaceName=galgame

; 字体字符集 (128 = Shift-JIS, 134 = GB2312, 1 = Default)
; 如果汉化后出现乱码，尝试改为 134 或 1
Charset=128

; 字体高度缩放倍率 (支持小数，例如 0.9 或 1.2)
; 用于修正汉化后字体过大或过小的问题
HeightScale=1.0

; 字体粗细 (0 = 默认, 400 = 标准, 700 = 粗体)
Weight=0

[Window]
; 是否启用窗口标题修改 (0 = 关闭, 1 = 开启)
Enable=1

; 自定义窗口标题内容
Title=壬戌之秋，七月既望。

[FileRedirect]
; 是否启用文件重定向 (0 = 关闭, 1 = 开启)
; 开启后，游戏读取文件时会优先从 Folder 指定的文件夹中查找
Enable=1

; 重定向文件夹名称 (默认为 Nepgear)
Folder=Nepgear

; 封包文件名（如果使用封包模式）
ArchiveFile=Nepgear.chs

[LocaleEmulator]
; 是否启用转区工具集成 (0 = 关闭, 1 = 开启)
; 只有设置为 1 时，才会将 LoaderDll.dll 和 LocaleEmulator.dll 部署到游戏根目录并执行转区
Enable=1

; 代码页 (932 = 日文 Shift-JIS, 936 = 中文 GBK)
CodePage=932

; 区域 ID (1041 = 日本, 2052 = 中国)
LocaleID=1041

; 字符集 ID (128 = Shift-JIS, 134 = GB2312)
Charset=128

; 时区设置 (Tokyo Standard Time = 东京时区, China Standard Time = 中国标准时间)
Timezone=Tokyo Standard Time

[Debug]
; 是否开启调试控制台 (0 = 关闭, 1 = 开启)
; 开启后会弹出一个 CMD 窗口显示 Hook 日志，用于排查文件加载路径等问题
Enable=1